#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/honestbank/terraform-gcp-gke-template/runs/run-ZPRuwqvmmQFPukkH

Waiting for the plan to start...

Terraform v0.13.4
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.gke.module.primary-cluster.random_string.cluster_service_account_suffix: Refreshing state... [id=56jm]
module.gke.module.primary-cluster.random_id.name["pool-01"]: Refreshing state... [id=n2k]
module.gke.module.cloud_nat.random_string.name_suffix: Refreshing state... [id=is7d3l]
module.gke.random_id.run_id: Refreshing state... [id=j25Xbg]
module.gke.data.google_project.service_project: Refreshing state... [id=projects/test-terraform-project-01]
module.gke.module.primary-cluster.data.google_compute_subnetwork.gke_subnetwork[0]: Refreshing state... [id=projects/test-gcp-project-01-274314/regions/asia-southeast2/subnetworks/test-private-vpc-subnet]
module.gke.data.google_project.host_project: Refreshing state... [id=projects/test-gcp-project-01-274314]
module.gke.module.primary-cluster.data.google_container_engine_versions.region: Refreshing state... [id=2020-10-21 07:49:43.535118297 +0000 UTC]
module.gke.module.primary-cluster.google_compute_firewall.master_webhooks[0]: Refreshing state... [id=projects/test-gcp-project-01-274314/global/firewalls/gke-test-template-1-8f6e576e-webhooks]
module.gke.module.primary-cluster.google_service_account.cluster_service_account[0]: Refreshing state... [id=projects/test-terraform-project-01/serviceAccounts/tf-gke-test-template-1-56jm@test-terraform-project-01.iam.gserviceaccount.com]
module.gke.module.cloud_nat.google_compute_router.router[0]: Refreshing state... [id=projects/test-gcp-project-01-274314/regions/asia-southeast2/routers/gke-router]
module.gke.google_compute_address.cloud_nat_ip: Refreshing state... [id=projects/test-gcp-project-01-274314/regions/asia-southeast2/addresses/gke-nat]
module.gke.data.google_client_config.default: Refreshing state... [id=projects/test-terraform-project-01/regions/asia-southeast2/zones/]
module.gke.module.primary-cluster.data.google_compute_zones.available: Refreshing state... [id=projects/test-terraform-project-01/regions/asia-southeast2]
module.gke.module.primary-cluster.data.google_client_config.default: Refreshing state... [id=projects/test-terraform-project-01/regions/asia-southeast2/zones/]
module.gke.module.primary-cluster.google_project_iam_member.cluster_service_account-log_writer[0]: Refreshing state... [id=test-terraform-project-01/roles/logging.logWriter/serviceaccount:tf-gke-test-template-1-56jm@test-terraform-project-01.iam.gserviceaccount.com]
module.gke.module.primary-cluster.google_compute_firewall.intra_egress[0]: Refreshing state... [id=projects/test-gcp-project-01-274314/global/firewalls/gke-test-template-1-8f6e576e-intra-cluster-egress]
module.gke.module.cloud_nat.google_compute_router_nat.main: Refreshing state... [id=test-gcp-project-01-274314/asia-southeast2/gke-router/cloud-nat-is7d3l]
module.gke.google_project_iam_binding.compute-network-user: Refreshing state... [id=test-gcp-project-01-274314/roles/compute.networkUser]
module.gke.module.primary-cluster.google_project_iam_member.cluster_service_account-metric_writer[0]: Refreshing state... [id=test-terraform-project-01/roles/monitoring.metricWriter/serviceaccount:tf-gke-test-template-1-56jm@test-terraform-project-01.iam.gserviceaccount.com]
module.gke.module.primary-cluster.data.google_container_engine_versions.zone: Refreshing state... [id=2020-10-21 07:49:43.809508047 +0000 UTC]
module.gke.module.primary-cluster.random_shuffle.available_zones: Refreshing state... [id=-]
module.gke.module.bootstrap.null_resource.setup_gcloud_cli: Refreshing state... [id=190526203064294534]
module.gke.module.bootstrap.null_resource.download_kubectl: Refreshing state... [id=8881277179964341956]
module.gke.module.primary-cluster.google_project_iam_member.cluster_service_account-monitoring_viewer[0]: Refreshing state... [id=test-terraform-project-01/roles/monitoring.viewer/serviceaccount:tf-gke-test-template-1-56jm@test-terraform-project-01.iam.gserviceaccount.com]
module.gke.module.primary-cluster.google_container_cluster.primary: Refreshing state... [id=projects/test-terraform-project-01/locations/asia-southeast2/clusters/test-template-1-8f6e576e]
module.gke.module.primary-cluster.google_project_iam_member.cluster_service_account-resourceMetadata-writer[0]: Refreshing state... [id=test-terraform-project-01/roles/stackdriver.resourceMetadata.writer/serviceaccount:tf-gke-test-template-1-56jm@test-terraform-project-01.iam.gserviceaccount.com]
module.gke.module.primary-cluster.google_container_node_pool.pools["pool-01"]: Refreshing state... [id=projects/test-terraform-project-01/locations/asia-southeast2/clusters/test-template-1-8f6e576e/nodePools/pool-01-9f69]
module.gke.module.bootstrap.null_resource.configure_kubectl: Refreshing state... [id=8592699448765506297]
module.gke.module.bootstrap.null_resource.install_Elastic_operator: Refreshing state... [id=5630555156851936733]
module.gke.module.bootstrap.null_resource.install_istio_operator: Refreshing state... [id=4877563573215901355]
module.gke.module.bootstrap.null_resource.set_kiali_credentials: Refreshing state... [id=6869749190291629182]
module.gke.module.bootstrap.null_resource.install_cert-manager_crds: Refreshing state... [id=6776032406381313269]
module.gke.module.bootstrap.null_resource.install_Elastic_resources: Refreshing state... [id=777053095019321926]
module.gke.data.google_container_cluster.current_cluster: Refreshing state... [id=projects/test-terraform-project-01/locations/asia-southeast2/clusters/test-template-1-8f6e576e]
module.gke.module.primary-cluster.module.gcloud_delete_default_kube_dns_configmap.module.gcloud_kubectl.null_resource.module_depends_on[0]: Refreshing state... [id=3838024610423208448]
module.gke.module.primary-cluster.module.gcloud_wait_for_cluster.null_resource.module_depends_on[0]: Refreshing state... [id=2498668216076623298]
module.gke.module.bootstrap.helm_release.jaeger: Refreshing state... [id=telemetry]
module.gke.module.bootstrap.helm_release.cert-manager: Refreshing state... [id=cert-manager]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.gke.module.bootstrap.null_resource.configure_kubectl must be replaced
-/+ resource "null_resource" "configure_kubectl" {
      ~ id       = "8592699448765506297" -> (known after apply)
      ~ triggers = {
          - "always_run" = "2020-10-21T08:17:39Z"
        } -> (known after apply) # forces replacement
    }

  # module.gke.module.bootstrap.null_resource.download_kubectl must be replaced
-/+ resource "null_resource" "download_kubectl" {
      ~ id       = "8881277179964341956" -> (known after apply)
      ~ triggers = {
          - "always_run" = "2020-10-21T08:17:34Z"
        } -> (known after apply) # forces replacement
    }

  # module.gke.module.bootstrap.null_resource.install_Elastic_operator must be replaced
-/+ resource "null_resource" "install_Elastic_operator" {
      ~ id       = "5630555156851936733" -> (known after apply)
      ~ triggers = {
          - "always_run" = "2020-10-21T08:17:40Z"
        } -> (known after apply) # forces replacement
    }

  # module.gke.module.bootstrap.null_resource.install_Elastic_resources must be replaced
-/+ resource "null_resource" "install_Elastic_resources" {
      ~ id       = "777053095019321926" -> (known after apply)
      ~ triggers = {
          - "always_run" = "2020-10-21T08:18:06Z"
        } -> (known after apply) # forces replacement
    }

  # module.gke.module.bootstrap.null_resource.install_IstioOperator_manifest will be created
  + resource "null_resource" "install_IstioOperator_manifest" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.gke.module.bootstrap.null_resource.install_cert-manager_crds must be replaced
-/+ resource "null_resource" "install_cert-manager_crds" {
      ~ id       = "6776032406381313269" -> (known after apply)
      ~ triggers = {
          - "always_run" = "2020-10-21T08:17:40Z"
        } -> (known after apply) # forces replacement
    }

  # module.gke.module.bootstrap.null_resource.install_istio_operator must be replaced
-/+ resource "null_resource" "install_istio_operator" {
      ~ id       = "4877563573215901355" -> (known after apply)
      ~ triggers = {
          - "always_run" = "2020-10-21T08:17:40Z"
        } -> (known after apply) # forces replacement
    }

  # module.gke.module.bootstrap.null_resource.set_kiali_credentials is tainted, so must be replaced
-/+ resource "null_resource" "set_kiali_credentials" {
      ~ id       = "6869749190291629182" -> (known after apply)
      ~ triggers = {
          - "always_run" = "2020-10-21T08:17:40Z"
        } -> (known after apply)
    }

  # module.gke.module.bootstrap.null_resource.setup_gcloud_cli must be replaced
-/+ resource "null_resource" "setup_gcloud_cli" {
      ~ id       = "190526203064294534" -> (known after apply)
      ~ triggers = {
          - "always_run" = "2020-10-21T08:17:34Z"
        } -> (known after apply) # forces replacement
    }

  # module.gke.module.primary-cluster.google_container_node_pool.pools["pool-01"] must be replaced
+/- resource "google_container_node_pool" "pools" {
        cluster             = "test-template-1-8f6e576e"
      ~ id                  = "projects/test-terraform-project-01/locations/asia-southeast2/clusters/test-template-1-8f6e576e/nodePools/pool-01-9f69" -> (known after apply)
        initial_node_count  = 1
      ~ instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/test-terraform-project-01/zones/asia-southeast2-a/instanceGroupManagers/gke-test-template-1-8f6e-pool-01-9f69-4804a4b3-grp",
          - "https://www.googleapis.com/compute/v1/projects/test-terraform-project-01/zones/asia-southeast2-b/instanceGroupManagers/gke-test-template-1-8f6e-pool-01-9f69-d2ec2687-grp",
          - "https://www.googleapis.com/compute/v1/projects/test-terraform-project-01/zones/asia-southeast2-c/instanceGroupManagers/gke-test-template-1-8f6e-pool-01-9f69-f94cd700-grp",
        ] -> (known after apply)
        location            = "asia-southeast2"
      ~ max_pods_per_node   = 110 -> (known after apply)
      ~ name                = "pool-01-9f69" -> (known after apply) # forces replacement
      + name_prefix         = (known after apply)
      ~ node_count          = 1 -> (known after apply)
      ~ node_locations      = [
          - "asia-southeast2-a",
          - "asia-southeast2-b",
          - "asia-southeast2-c",
        ] -> (known after apply)
        project             = "test-terraform-project-01"
      ~ version             = "1.18.9-gke.801" -> (known after apply)

        autoscaling {
            max_node_count = 2
            min_node_count = 1
        }

        management {
            auto_repair  = true
            auto_upgrade = true
        }

      ~ node_config {
            disk_size_gb      = 200
            disk_type         = "pd-standard"
            guest_accelerator = []
            image_type        = "COS"
            labels            = {
                "cluster_name" = "test-template-1-8f6e576e"
                "node_pool"    = "pool-01"
            }
          ~ local_ssd_count   = 1 -> 0 # forces replacement
            machine_type      = "n1-standard-2"
            metadata          = {
                "cluster_name"             = "test-template-1-8f6e576e"
                "disable-legacy-endpoints" = "true"
                "node_pool"                = "pool-01"
            }
            oauth_scopes      = [
                "https://www.googleapis.com/auth/devstorage.read_only",
                "https://www.googleapis.com/auth/logging.write",
                "https://www.googleapis.com/auth/monitoring",
                "https://www.googleapis.com/auth/service.management.readonly",
                "https://www.googleapis.com/auth/servicecontrol",
                "https://www.googleapis.com/auth/trace.append",
            ]
            preemptible       = false
            service_account   = "tf-gke-test-template-1-56jm@test-terraform-project-01.iam.gserviceaccount.com"
            tags              = [
                "gke-test-template-1-8f6e576e",
                "gke-test-template-1-8f6e576e-pool-01",
            ]
          ~ taint             = [] -> (known after apply)

            shielded_instance_config {
                enable_integrity_monitoring = true
                enable_secure_boot          = false
            }

            workload_metadata_config {
                node_metadata = "GKE_METADATA_SERVER"
            }
        }

        timeouts {
            create = "45m"
            delete = "45m"
            update = "45m"
        }

        upgrade_settings {
            max_surge       = 1
            max_unavailable = 0
        }
    }

  # module.gke.module.primary-cluster.random_id.name["pool-01"] must be replaced
+/- resource "random_id" "name" {
      ~ b64_std     = "pool-01-n2k=" -> (known after apply)
      ~ b64_url     = "pool-01-n2k" -> (known after apply)
        byte_length = 2
      ~ dec         = "pool-01-40809" -> (known after apply)
      ~ hex         = "pool-01-9f69" -> (known after apply)
      ~ id          = "n2k" -> (known after apply)
      ~ keepers     = { # forces replacement
            "accelerator_count" = ""
            "accelerator_type"  = ""
            "disk_size_gb"      = "200"
            "disk_type"         = "pd-standard"
            "labels"            = ""
          ~ "local_ssd_count"   = "1" -> "0"
            "machine_type"      = "n1-standard-2"
            "metadata"          = ""
            "oauth_scopes"      = "https://www.googleapis.com/auth/devstorage.read_only,https://www.googleapis.com/auth/logging.write,https://www.googleapis.com/auth/monitoring,https://www.googleapis.com/auth/service.management.readonly,https://www.googleapis.com/auth/servicecontrol,https://www.googleapis.com/auth/trace.append"
            "preemptible"       = "false"
            "service_account"   = ""
            "tags"              = ""
        }
        prefix      = "pool-01-"
    }

Plan: 11 to add, 0 to change, 10 to destroy.

Changes to Outputs:
  ~ client_token = (sensitive value)
```

</details>

*Pusher: @jai, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform GitHub Actions`*